{
    "header1": "Het Vak",
    "card1": "Cursusdoel",
    "card1content": "Het Internet is een van de meest relevante toepassingen van informatica in de wereld. En voor veel mensen in de buitenwereld staat het Internet zelfs gelijk aan de meest zichtbare component daarvan: het World Wide Web. In deze praktische cursus kijken we hoe voor dit specifieke onderdeel van het Internet geprogrammeerd kan worden, op een veilige en werkbare manier, zowel voor de eindgebruiker als voor de programmeur. De historische context en bijbehorende technische concepten worden toegelicht.",
    "card2": "Vakinhoudelijk",
    "card2content": "Het uitgangspunt van dit vak is het http protocol en alles wat daar bovenop gebouwd kan worden. Daarbij wordt ervaring opgedaan met relevante talen en technologieen, zoals (X)HTML, CSS, JavaScript, PHP en frameworks. Daarnaast wordt ingegaan op de historische context van het WWW en worden de concepten achter en allerlei technische aspecten van het WWW toegelicht. Ook dient de deelnemer zich het bijbehorende jargon eigen te maken.",
    "card3": "Het project",
    "card3content": "Voor dit project zijn wij begonnen met het maken van een github en een whatsapp groep voor bestanden delen en communicatie. In de groep verschilt de ervaring met verschillende programmeertalen zoals hieronder wordt aangegeven in de tabel. Daarna volg de beschrijving van de eerste opdracht, waarvoor wij deze website hebben gemaakt, zoals die ook te vinden is op Blackboard.",
    "link1name": "Opdracht op BB",
    "table1": [["Naam", "programmeertalen", "Ervaring met websites", "Sterke puntern"],
            ["André", "C#, Flutter/dart, HTML", "Minimaal", "Leervermogen, Vrije tijd"],
            ["Ian", "C++, C#, Haskell", "Python"],
            ["Quinten", "HTML, CSS, JavaScript, Python, Java, Dart, PHP", "ja", "Front-end development"]],
    "header2": "De eerste opdracht",
    "Header3": "Description",
    "texts1": "Develop a static website about your group. Use the Web-representation technologies and apply standards and best practices discussed during Lectures 2 and 3 (HTML5, CSS3, accessibility, responsive design, SEO, good coding style, etc.). The visual appeal of your design is highly welcomed but no strict requirements are specified. Yet, please, avoid deliberately repulsive color combinations. Your website is expected to present meaningful information about the members of the group. The pages should be bigger than a paragraph, but smaller than a book chapter.",
    "header4": "requirements",
    "texts2": "Your website must:",
    "list1": ["have at least 3 pages with meaningful content",
            "use HTML5 semantic elements for formatting",
            "use images",
            "have links between pages, within pages, and to external page(s)",
            "have at least one table (not used for formatting a webpage layout)",
            "be optimised for search engines",
            "use consistent layout and colour scheme",
            "use CSS for formatting, including at least:",
            "several different styles for links",
            "several different styles for text",
            "styles for table elements",
            "cascading styles through selector spesificity",
            "style inheritance",
            "define all formatting styles in a separate CSS file",
            "be compliant with the HTML5 rules of ",
            "W3C Markup Validation Service",
            " and the CSS3 rules of ",
            "W3C CSS Validation Service",
            "not use any of the deprecated HTML elements or attributes (see for example ",
            "here)",
            "render correctly in the current versions of Chrome and Firefox browsers",
            "follow the Web accessibility standard on",
            "Keyboard compatibility",
            "Text to speech",
            "Clear layout and design",
            "Customizable text",
            "Understandable content",
            "follow the responsive Web design guidelines for",
            "images",
            "content positioning",
            "units of measurement"],
    "header5": "Maintain good coding style",
    "list2": ["use indentation for nested HTML elements",
            "names for HTML elements and attributes",
            "use quotation marks for attribute values",
            "always use alt attribute with img elements",
            "use meaningful names for CSS classes",
            "follow the BEM naming convention for CSS classes",
            "short CSS rules can be written on one line, but long rules need to occupy multiple lines",
            "use lower case file names",
            "make sure your website has a clear and logical file structure (index.html, meaningful names of files and folders)"],
    "header6": "Procedure",
    "list3": ["complete and submit your website in groups",
            "the website should be archived and submitted as a single zip through the",
            "BlackBoard",
            " system"],
    "header7": "Academic intergrity",
    "texts3": "The work should be done by you and your peers only. You can rely on the support of teaching assistants and student assistants during the practicum time, but you are not allowed to use the code of other groups. It is also forbidden to use HTML generating services and programs. You are required to manually create both the HTML and the CSS code. You can use&nbsp;external sources for the content of your website, however, you must refer to them by linking and naming."
}